

INSERT INTO assets ("Id", "Quantity", "Name")
VALUES (1,30, 'Труба 219х6'),
       (2, 20, 'Труба 108х4'),
       (3, 45, 'Лист 3мм'),
       (4, 20, 'Переход К-108х4-219х6'),
       (5, 10,'Отвод 108х4'),
       (6, 15, 'Фланец 100'),
       (7, 35,'Фланец 200'),
       (8, 123, 'Труба 34х4'),
       (9, 200, 'Круг 40'),
       (10, 0, 'Форсунка 01.01'),
       (11, 2, 'Штуцер 01.02'),
       (12, 0, 'Распылитель 01.00'),
       (13, 1, 'Корпус 02.01'),
       (14, 2, 'Вставка 02.02'),
       (15, 0, 'Огнепреградитель 02.00');

INSERT INTO operations ("Id", "Name", "Duration")
VALUES (1, 'Поставка Труба 219х6', '20'),
       (2, 'Поставка Труба 108х4', '20'),
       (3, 'Поставка Лист 3мм', '15'),
       (4, 'Поставка Переход К-108х4-219х6', '10'),
       (5, 'Поставка Отвод 108х4', '10'),
       (6, 'Поставка Фланец 100', '10'),
       (7, 'Поставка Фланец 200', '10'),
       (8, 'Поставка Труба 34х4', '10'),
       (9, 'Поставка Круг 40', '10'),
       (10, 'Отрезка DN25', '2'),
       (11, 'Отрезка DN40', '5'),
       (12, 'Точение DN25', '15'),
       (13, 'Точение DN40', '30'),
       (14, 'Фрезерование DN40', '20'),
       (15, 'Сборка распылителя DN25', '10'),
       (16, 'Покраска DN25', '5'),
       (17, 'Упаковка DN25', '10'),
       (18, 'Отрезка трубы DN200', '10'),
       (19, 'Точение трубы DN200', '5'),
       (20, 'Сварка корпуса DN100', '30'),
       (21, 'Сборка огнепреградителя DN100', '15'),
       (22, 'Покраска DN100', '25'),
       (23, 'Упаковка DN100', '20');

INSERT INTO orders ("Id", "Name", "OrderCreated", "PlanDateStart", "PlanDateEnd", "ActualDateStart", "ActualDateEnd", "IsActive")
VALUES (1, 'Заказ 0001', '2026-01-31', '2026-02-01', '2026-03-10', '2026-02-05', '2026-02-18', true),
       (2, 'Заказ 0002', '2026-01-31', '2026-02-03', '2026-03-15', '2026-02-07', '2026-02-19', true),
       (3, 'Заказ 0003', '2026-01-31', '2026-02-05', '2026-03-20', '2026-02-09', '2026-02-20', true),
       (4, 'Заказ 0004', '2026-01-31', '2026-02-07', '2026-03-25', '2026-02-11', '2026-04-10', true),
       (5, 'Заказ 0005', '2026-01-31', '2026-02-09', '2026-03-30', '2026-02-13', '2026-04-20', true);

INSERT INTO processes ("Id", "Name", "Duration", "Quantity")
VALUES (1, 'Изготовление распылителей', '10', 10),
       (2, 'Изготовление огнепреградителей', '30', 20),
       (3, 'Изготовление корпусов', '2', 40),
       (4, 'Изготовление вставок', '1', 20),
       (5, 'Изготовление штуцеров', '10', 10),
       (6, 'Изготовление форсунок', '10', 10),
       (7, 'Покраска распылителей', '1', 10),
       (8, 'Покраска огнепреградителей', '2', 20),
       (9, 'Упаковка распылителей', '1', 10),
       (10, 'Упаковка огнепреградителей', '2', 20);

INSERT INTO sub_items ("ItemId", "SubItemId", "Quantity")
VALUES (12, 10, 1),
       (12, 11, 1),
       (15, 13, 2),
       (15, 14, 1),
       (14, 1, 100),
       (13, 4, 1),
       (13, 6, 1),
       (13, 7, 1),
       (10, 9, 50),
       (11, 8, 100);

INSERT INTO order_items ("OrderId", "ItemId", "Quantity")
VALUES (1, 12, 10),
       (1, 15, 5),
       (2, 12, 20),
       (2, 15, 100),
       (3, 12, 10),
       (3, 15, 50),
       (4, 12, 1),
       (4, 15, 3),
       (5, 12, 50),
       (5, 15, 100);

INSERT INTO operation_items ("OperationId", "ItemId", "Quantity","ItemType")
VALUES (12, 10, 1, 'Product'),
       (12, 11, 1, 'Product'),
       (15, 13, 2, 'Product'),
       (15, 14, 1, 'Product'),
       (14, 1, 100, 'Sources'),
       (13, 4, 1, 'Sources'),
       (13, 6, 1, 'Sources'),
       (13, 7, 1, 'Sources'),
       (10, 9, 50, 'Sources'),
       (11, 8, 100, 'Sources');

INSERT INTO sub_processes ("ProcessId","SubProcessId")
VALUES (1, 5),
       (1, 6),
       (1, 7),
       (1, 9),
       (2, 3),
       (2, 4),
       (2, 8),
       (2, 10);

INSERT INTO persons ("Id", "Name", "LastName", "Patronymic", "PhoneNumber", "Birthday", "Address")
VALUES (1,'Иван', 'Иванов', 'Иванович', '89123456789', '1990-01-01', 'г. Москва, ул. Ленина, д. 1'),
       (2, 'Петр', 'Петров', 'Петрович', '89123456788', '1991-02-02', 'г. Москва, ул. Ленина, д. 2'),
       (3, 'Сидор', 'Сидоров', 'Сидорович', '89123456787', '1992-03-03', 'г. Москва, ул. Ленина, д. 3'),
       (4, 'Александр', 'Александров', 'Александрович', '89123456786', '1993-04-04', 'г. Москва, ул. Ленина, д. 4'),
       (5, 'Николай', 'Николаев', 'Николаевич', '89123456785', '1994-05-05', 'г. Москва, ул. Ленина, д.5'),
       (6, 'Сергей', 'Сергеев', 'Сергеевич', '89123456784', '1995-06-06', 'г. Москва, ул. Ленина, д. 6'),
       (7, 'Андрей', 'Андреев', 'Андреевич', '89123456783', '1996-07-07', 'г. Москва, ул. Ленина, д. 7'),
       (8, 'Евгений', 'Евгеньев', 'Евгеньевич', '89123456782', '1997-08-08', 'г. Москва, ул. Ленина, д. 8'),
       (9, 'Максим', 'Максимов', 'Максимович', '89123456781', '1998-09-09', 'г. Москва, ул. Ленина, д. 9'),
       (10, 'Алексей', 'Алексеев', 'Алексеевич', '89123456780', '1999-10-10', 'г. Москва, ул. Ленина, д. 10');

INSERT INTO employees ("Id","Profession", "Salary", "PersonId")
VALUES (1,'Токарь', 70000, 1),
       (2, 'Фрезеровщик', 80000, 2),
       (3, 'Маляр', 60000, 3),
       (4, 'Сварщик', 90000, 4),
       (5, 'Слесарь',50000, 5),
       (6, 'Слесарь',50000, 6),
       (7, 'Слесарь',50000, 7),
       (8, 'Слесарь',50000, 8),
       (9, 'Слесарь',50000, 9),
       (10, 'Слесарь',50000, 10);

INSERT INTO equipments ("Id", "Name", "Cost")
VALUES (1,'Станок токарный', 100000),
       (2, 'Станок сверлильный', 30000),
       (3, 'Станок фрезерный', 120000),
       (4, 'Станок гибочный', 150000),
       (5, 'Сварочный аппарат',40000),
       (6, 'Пила ленточная', 70000),
       (7, 'УШМ',7000),
       (8, 'Пресс для гидроиспытаний', 5000),
       (9, 'Набор слесарных инструментов', 3000),
       (10, 'Покрасочная камера', '500000');