INSERT INTO assets ("Id", "Quantity", "Name")
VALUES ('09d6673a-a380-4286-bbf4-c4bc0455da4d',30, 'Труба 219х6'),
       ('fc813543-14c4-4cea-ab46-afd6b5bd30ab', 20, 'Труба 108х4'),
       ('fe7cb8f1-11f7-4bf3-9a57-9d96c1e8aab0', 45, 'Лист 3мм'),
       ('87f66f60-4310-46d4-92d7-15742a36c2e3', 20, 'Переход К-108х4-219х6'),
       ('7dcd0864-2210-4a08-b050-5777f640316d', 10,'Отвод 108х4'),
       ('c2847754-aab9-44a1-9682-050ba6f4c2bd', 15, 'Фланец 100'),
       ('563fb313-d096-4a2b-afd9-1bfff4316e72', 35,'Фланец 200'),
       ('4b158f60-3a58-4480-b83d-6b93a6650c6b', 123, 'Труба 34х4'),
       ('fcf884c1-2692-4bcc-add4-76b5bc5c0c7d', 200, 'Круг 40'),
       ('817fd839-6715-489f-b30c-c8c9852f1ed9', 0, 'Форсунка 01.01'),
       
       ('1056cba9-da5c-49c5-900d-ccff8abf6864', 2, 'Штуцер 01.02'),
       ('48f6c0af-e9a4-4065-8224-7114b178a9cd', 0, 'Распылитель 01.00'),
       ('2af6469b-f21e-4979-a4ab-d20a879d5f63', 1, 'Корпус 02.01'),
       ('046233d9-2512-4999-a623-71a704400756', 2, 'Вставка 02.02'),
       ('5c598896-c91f-4a50-80e3-e28cdd268551', 0, 'Огнепреградитель 02.00');

INSERT INTO operations ("Id", "Name", "Duration")
VALUES ('d58713f7-5c20-440d-86a5-cfae71b04974', 'Поставка Труба 219х6', '20'),
       ('020dc8a3-bfcd-4481-8013-cef0400fc4a6', 'Поставка Труба 108х4', '20'),
       ('35e2b581-a690-45d1-920e-8b45fb343c1f', 'Поставка Лист 3мм', '15'),
       ('165a5ee7-30c7-4eda-9810-f4f888e610ab', 'Поставка Переход К-108х4-219х6', '10'),
       ('2c7c669d-3cdb-403b-95d2-3a87498603f4', 'Поставка Отвод 108х4', '10'),
       ('d77eaa4a-f0cf-4447-a922-97cf5b31ea35', 'Поставка Фланец 100', '10'),
       ('03375b98-948c-4f5c-9a92-0cce1e87a6cc', 'Поставка Фланец 200', '10'),
       ('acb42aea-8ff9-4741-addf-217f1d2a063f', 'Поставка Труба 34х4', '10'),
       ('51abc02e-7d78-43e5-99b6-f93ca8a3baa1', 'Поставка Круг 40', '10'),
       ('e7703233-46fa-4aa1-b1f2-cdf47dfa4b48', 'Отрезка DN25', '2'),
       
       ('c910a1b6-90cd-4e3e-b00a-8a9e8e5d7f68', 'Отрезка DN40', '5'),
       ('40639c6f-2f14-4b9d-b8ce-de51e51fd7ee', 'Точение DN25', '15'),
       ('1bfa3e0f-fd90-4aed-87b0-c1cfb40d46b5', 'Точение DN40', '30'),
       ('b1797e32-ce8f-480e-95da-f8454946990b', 'Фрезерование DN40', '20'),
       ('fc2d273a-cab5-4250-8a1b-4dacc54240ec', 'Сборка распылителя DN25', '10'),
       ('1cd1637a-8ecb-4617-9c71-40178b3782be', 'Покраска DN25', '5'),
       ('9fa1e013-3779-4bd1-964a-c525613187a6', 'Упаковка DN25', '10'),
       ('c46d6dc2-c048-4ce0-9db5-abd0e89cd54d', 'Отрезка трубы DN200', '10'),
       ('db433f57-711f-417c-b268-a6f7b0329eb3', 'Точение трубы DN200', '5'),
       ('5d0c454c-4f6f-44ef-adc7-20168c748b11', 'Сварка корпуса DN100', '30'),
       
       ('52c3d679-1584-4e6e-855d-03e4bb9cd9cb', 'Сборка огнепреградителя DN100', '15'),
       ('65301618-0248-4b06-b670-2ac38da3c7f6', 'Покраска DN100', '25'),
       ('84167153-9216-4af0-901b-398810a34b9e', 'Упаковка DN100', '20');

INSERT INTO operation_items ("OperationId", "ItemId", "Quantity","ItemType")
VALUES ('40639c6f-2f14-4b9d-b8ce-de51e51fd7ee', '817fd839-6715-489f-b30c-c8c9852f1ed9', 1, 'Product'),
       ('40639c6f-2f14-4b9d-b8ce-de51e51fd7ee', '1056cba9-da5c-49c5-900d-ccff8abf6864', 1, 'Product'),
       ('fc2d273a-cab5-4250-8a1b-4dacc54240ec', '2af6469b-f21e-4979-a4ab-d20a879d5f63', 2, 'Product'),
       ('fc2d273a-cab5-4250-8a1b-4dacc54240ec', '046233d9-2512-4999-a623-71a704400756', 1, 'Product'),
       ('b1797e32-ce8f-480e-95da-f8454946990b', '09d6673a-a380-4286-bbf4-c4bc0455da4d', 100, 'Sources'),
       ('1bfa3e0f-fd90-4aed-87b0-c1cfb40d46b5', '87f66f60-4310-46d4-92d7-15742a36c2e3', 1, 'Sources'),
       ('1bfa3e0f-fd90-4aed-87b0-c1cfb40d46b5', 'c2847754-aab9-44a1-9682-050ba6f4c2bd', 1, 'Sources'),
       ('1bfa3e0f-fd90-4aed-87b0-c1cfb40d46b5', '563fb313-d096-4a2b-afd9-1bfff4316e72', 1, 'Sources'),
       ('e7703233-46fa-4aa1-b1f2-cdf47dfa4b48', 'fcf884c1-2692-4bcc-add4-76b5bc5c0c7d', 50, 'Sources'),
       ('c910a1b6-90cd-4e3e-b00a-8a9e8e5d7f68', '4b158f60-3a58-4480-b83d-6b93a6650c6b', 100, 'Sources');

INSERT INTO orders ("Id", "Name", "OrderCreated", "PlanDateStart", "PlanDateEnd", "ActualDateStart", "ActualDateEnd", "IsActive")
VALUES ('78c86de5-b632-4b64-9dce-3e329b94d40a', 'Заказ 0001', '2026-01-31', '2026-02-01', '2026-03-10', '2026-02-05', '2026-02-18', true),
       ('3aeed4e1-81dd-44e9-af53-006737c73446', 'Заказ 0002', '2026-01-31', '2026-02-03', '2026-03-15', '2026-02-07', '2026-02-19', true),
       ('370de512-dc41-4234-977c-e00cac6b57be', 'Заказ 0003', '2026-01-31', '2026-02-05', '2026-03-20', '2026-02-09', '2026-02-20', true),
       ('063b6e48-d936-46d8-ad6d-36a643ba477c', 'Заказ 0004', '2026-01-31', '2026-02-07', '2026-03-25', '2026-02-11', '2026-04-10', true),
       ('dbde895b-1ca0-461c-b528-e9cf66fbc82c', 'Заказ 0005', '2026-01-31', '2026-02-09', '2026-03-30', '2026-02-13', '2026-04-20', true);

INSERT INTO order_items ("OrderId", "ItemId", "Quantity")
VALUES ('78c86de5-b632-4b64-9dce-3e329b94d40a', '48f6c0af-e9a4-4065-8224-7114b178a9cd', 10),
       ('78c86de5-b632-4b64-9dce-3e329b94d40a', '5c598896-c91f-4a50-80e3-e28cdd268551', 5),
       ('3aeed4e1-81dd-44e9-af53-006737c73446', '48f6c0af-e9a4-4065-8224-7114b178a9cd', 20),
       ('3aeed4e1-81dd-44e9-af53-006737c73446', '5c598896-c91f-4a50-80e3-e28cdd268551', 100),
       ('370de512-dc41-4234-977c-e00cac6b57be', '48f6c0af-e9a4-4065-8224-7114b178a9cd', 10),
       ('370de512-dc41-4234-977c-e00cac6b57be', '5c598896-c91f-4a50-80e3-e28cdd268551', 50),
       ('063b6e48-d936-46d8-ad6d-36a643ba477c', '48f6c0af-e9a4-4065-8224-7114b178a9cd', 1),
       ('063b6e48-d936-46d8-ad6d-36a643ba477c', '5c598896-c91f-4a50-80e3-e28cdd268551', 3),
       ('dbde895b-1ca0-461c-b528-e9cf66fbc82c', '48f6c0af-e9a4-4065-8224-7114b178a9cd', 50),
       ('dbde895b-1ca0-461c-b528-e9cf66fbc82c', '5c598896-c91f-4a50-80e3-e28cdd268551', 100);

INSERT INTO sub_items ("ItemId", "SubItemId", "Quantity")
VALUES ('48f6c0af-e9a4-4065-8224-7114b178a9cd', '817fd839-6715-489f-b30c-c8c9852f1ed9', 1),
       ('48f6c0af-e9a4-4065-8224-7114b178a9cd', '1056cba9-da5c-49c5-900d-ccff8abf6864', 1),
       ('5c598896-c91f-4a50-80e3-e28cdd268551', '2af6469b-f21e-4979-a4ab-d20a879d5f63', 2),
       ('5c598896-c91f-4a50-80e3-e28cdd268551', '046233d9-2512-4999-a623-71a704400756', 1),
       ('046233d9-2512-4999-a623-71a704400756', '09d6673a-a380-4286-bbf4-c4bc0455da4d', 100),
       ('2af6469b-f21e-4979-a4ab-d20a879d5f63', '87f66f60-4310-46d4-92d7-15742a36c2e3', 1),
       ('2af6469b-f21e-4979-a4ab-d20a879d5f63', 'c2847754-aab9-44a1-9682-050ba6f4c2bd', 1),
       ('2af6469b-f21e-4979-a4ab-d20a879d5f63', '563fb313-d096-4a2b-afd9-1bfff4316e72', 1),
       ('817fd839-6715-489f-b30c-c8c9852f1ed9', 'fcf884c1-2692-4bcc-add4-76b5bc5c0c7d', 50),
       ('1056cba9-da5c-49c5-900d-ccff8abf6864', '4b158f60-3a58-4480-b83d-6b93a6650c6b', 100);

INSERT INTO processes ("Id", "Name", "Duration", "Quantity")
VALUES ('da102245-362f-457a-af3c-b5cc49cf8a8d', 'Изготовление распылителей', '10', 10),
       ('5ab7f814-bd8b-40ad-9859-595c1e44b55b', 'Изготовление огнепреградителей', '30', 20),
       ('8230b51e-2f71-4360-9e0d-ace41a62a58c', 'Изготовление корпусов', '2', 40),
       ('e154bcbf-ee44-4304-bb78-36f33c7423d9', 'Изготовление вставок', '1', 20),
       ('be7e3d7e-04d2-4618-9387-3eaf20a2016b', 'Изготовление штуцеров', '10', 10),
       ('70a0c033-b9a1-44a6-b018-91ac264283ea', 'Изготовление форсунок', '10', 10),
       ('d22215ab-09f6-433b-a058-4dcb3c959aa1', 'Покраска распылителей', '1', 10),
       ('61a58717-8af7-4fe8-abe3-69b23c506a40', 'Покраска огнепреградителей', '2', 20),
       ('8d24953b-c70a-494b-983e-e7b13d86272b', 'Упаковка распылителей', '1', 10),
       ('5e5129b9-956e-4b47-ab6c-f4d2663e277c', 'Упаковка огнепреградителей', '2', 20);

INSERT INTO sub_processes ("ProcessId","SubProcessId")
VALUES ('da102245-362f-457a-af3c-b5cc49cf8a8d', 'be7e3d7e-04d2-4618-9387-3eaf20a2016b'),
       ('da102245-362f-457a-af3c-b5cc49cf8a8d', '70a0c033-b9a1-44a6-b018-91ac264283ea'),
       ('da102245-362f-457a-af3c-b5cc49cf8a8d', 'd22215ab-09f6-433b-a058-4dcb3c959aa1'),
       ('da102245-362f-457a-af3c-b5cc49cf8a8d', '8d24953b-c70a-494b-983e-e7b13d86272b'),
       ('5ab7f814-bd8b-40ad-9859-595c1e44b55b', '8230b51e-2f71-4360-9e0d-ace41a62a58c'),
       ('5ab7f814-bd8b-40ad-9859-595c1e44b55b', 'e154bcbf-ee44-4304-bb78-36f33c7423d9'),
       ('5ab7f814-bd8b-40ad-9859-595c1e44b55b', '61a58717-8af7-4fe8-abe3-69b23c506a40'),
       ('5ab7f814-bd8b-40ad-9859-595c1e44b55b', '5e5129b9-956e-4b47-ab6c-f4d2663e277c');

INSERT INTO persons ("Id", "Name", "LastName", "Patronymic", "PhoneNumber", "Birthday", "Address")
VALUES ('8a6cbfa3-8d11-445b-afc8-f84d52559721','Иван', 'Иванов', 'Иванович', '89123456789', '1990-01-01', 'г. Москва, ул. Ленина, д. 1'),
       ('7bdeef08-fb70-44e8-b515-04294ce41507', 'Петр', 'Петров', 'Петрович', '89123456788', '1991-02-02', 'г. Москва, ул. Ленина, д. 2'),
       ('69939aac-d931-4505-9d12-ebb879ba1d26', 'Сидор', 'Сидоров', 'Сидорович', '89123456787', '1992-03-03', 'г. Москва, ул. Ленина, д. 3'),
       ('760320be-8c42-4b42-9bc4-fa8a4f280e8a', 'Александр', 'Александров', 'Александрович', '89123456786', '1993-04-04', 'г. Москва, ул. Ленина, д. 4'),
       ('0c1d6c86-f65f-4dd2-a910-a63cd463d8a6', 'Николай', 'Николаев', 'Николаевич', '89123456785', '1994-05-05', 'г. Москва, ул. Ленина, д.5'),
       ('b2c71614-7dd9-40f5-817d-a9e4cd7832c5', 'Сергей', 'Сергеев', 'Сергеевич', '89123456784', '1995-06-06', 'г. Москва, ул. Ленина, д. 6'),
       ('c3cec6b4-e545-4bf8-a6e9-6176bc7eaf18', 'Андрей', 'Андреев', 'Андреевич', '89123456783', '1996-07-07', 'г. Москва, ул. Ленина, д. 7'),
       ('34c99b93-be51-42b6-9715-2f00cbbeaadb', 'Евгений', 'Евгеньев', 'Евгеньевич', '89123456782', '1997-08-08', 'г. Москва, ул. Ленина, д. 8'),
       ('921f5c51-7aca-472c-ac00-a3989182fbd7', 'Максим', 'Максимов', 'Максимович', '89123456781', '1998-09-09', 'г. Москва, ул. Ленина, д. 9'),
       ('07c9d673-0817-4396-bd44-5c1e5360213b', 'Алексей', 'Алексеев', 'Алексеевич', '89123456780', '1999-10-10', 'г. Москва, ул. Ленина, д. 10');

INSERT INTO employees ("Id","Profession", "Salary", "PersonId")
VALUES (gen_random_uuid(), 'Токарь', 70000, '8a6cbfa3-8d11-445b-afc8-f84d52559721'),
       (gen_random_uuid(), 'Фрезеровщик', 80000, '7bdeef08-fb70-44e8-b515-04294ce41507'),
       (gen_random_uuid(), 'Маляр', 60000, '69939aac-d931-4505-9d12-ebb879ba1d26'),
       (gen_random_uuid(), 'Сварщик', 90000, '760320be-8c42-4b42-9bc4-fa8a4f280e8a'),
       (gen_random_uuid(), 'Слесарь',50000, '0c1d6c86-f65f-4dd2-a910-a63cd463d8a6'),
       (gen_random_uuid(), 'Слесарь',50000, 'b2c71614-7dd9-40f5-817d-a9e4cd7832c5'),
       (gen_random_uuid(), 'Слесарь',50000, 'c3cec6b4-e545-4bf8-a6e9-6176bc7eaf18'),
       (gen_random_uuid(), 'Слесарь',50000, '34c99b93-be51-42b6-9715-2f00cbbeaadb'),
       (gen_random_uuid(), 'Слесарь',50000, '921f5c51-7aca-472c-ac00-a3989182fbd7'),
       (gen_random_uuid(), 'Слесарь',50000, '07c9d673-0817-4396-bd44-5c1e5360213b');

INSERT INTO equipments ("Id","Name", "Cost")
VALUES (gen_random_uuid(), 'Станок токарный', 100000),
       (gen_random_uuid(), 'Станок сверлильный', 30000),
       (gen_random_uuid(), 'Станок фрезерный', 120000),
       (gen_random_uuid(), 'Станок гибочный', 150000),
       (gen_random_uuid(), 'Сварочный аппарат',40000),
       (gen_random_uuid(), 'Пила ленточная', 70000),
       (gen_random_uuid(), 'УШМ',7000),
       (gen_random_uuid(), 'Пресс для гидроиспытаний', 5000),
       (gen_random_uuid(), 'Набор слесарных инструментов', 3000),
       (gen_random_uuid(), 'Покрасочная камера', '500000');