INSERT INTO Items (ItemId, Name)
VALUES (1,'Труба 219х6'),
       (2, 'Труба 108х4'),
       (3, 'Лист 3мм'),
       (4, 'Переход К-108х4-219х6'),
       (5, 'Отвод 108х4'),
       (6, 'Фланец 100'),
       (7, 'Фланец 200'),
       (8, 'Труба 34х4'),
       (9, 'Круг 40'),
       (10, 'Форсунка 01.01'),
       (11, 'Штуцер 01.02'),
       (12, 'Распылитель 01.00'),
       (13, 'Корпус 02.01'),
       (14, 'Вставка 02.02'),
       (15, 'Огнепреградитель 02.00');

INSERT INTO Operations (OperationId, Name, Duration)
VALUES (1, 'Поставка Труба 219х6', '20 day'),
       (2, 'Поставка Труба 108х4', '20 day'),
       (3, 'Поставка Лист 3мм', '15 day'),
       (4, 'Поставка Переход К-108х4-219х6', '10 day'),
       (5, 'Поставка Отвод 108х4', '10 day'),
       (6, 'Поставка Фланец 100', '10 day'),
       (7, 'Поставка Фланец 200', '10 day'),
       (8, 'Поставка Труба 34х4', '10 day'),
       (9, 'Поставка Круг 40', '10 day'),
       (10, 'Отрезка DN25', '2 min'),
       (11, 'Отрезка DN40', '5 min'),
       (12, 'Точение DN25', '15 min'),
       (13, 'Точение DN40', '30 min'),
       (14, 'Фрезерование DN40', '20 min'),
       (15, 'Сборка распылителя DN25', '10 min'),
       (16, 'Покраска DN25', '5 min'),
       (17, 'Упаковка DN25', '10 min'),
       (18, 'Отрезка трубы DN200', '10 min'),
       (19, 'Точение трубы DN200', '5 min'),
       (20, 'Сварка корпуса DN100', '30 min'),
       (21, 'Сборка огнепреградителя DN100', '15 min'),
       (22, 'Покраска DN100', '25 min'),
       (23, 'Упаковка DN100', '20 min');

INSERT INTO Orders (OrderId, Name)
VALUES (1, 'Заказ 0001'),
       (2, 'Заказ 0002'),
       (3, 'Заказ 0003'),
       (4, 'Заказ 0004'),
       (5, 'Заказ 0005');

INSERT INTO Processes (ProcessId, Name, Duration, Quantity)
VALUES (1, 'Изготовление распылителей', '10 day', 10),
       (2, 'Изготовление огнепреградителей', '30 day', 20),
       (3, 'Изготовление корпусов', '2 day', 40),
       (4, 'Изготовление вставок', '1 day', 20),
       (5, 'Изготовление штуцеров', '10 day', 10),
       (6, 'Изготовление форсунок', '10 day', 10),
       (7, 'Покраска распылителей', '1 day', 10),
       (8, 'Покраска огнепреградителей', '2 day', 20),
       (9, 'Упаковка распылителей', '1 day', 10),
       (10, 'Упаковка огнепреградителей', '2 day', 20);

INSERT INTO Sub_Items (ItemId, SubItemId, Quantity)
VALUES (12, 10, 1),
       (12, 11, 1),
       (15, 13, 2),
       (15, 14, 1),
       (14, 1, 100),
       (13, 4, 1),
       (13, 6, 1),
       (13, 7, 1),
       (10, 9, 50),
       (11, 8, 100);

INSERT INTO Order_Items (OrderId, ItemId, Quantity)
VALUES (1, 12, 10),
       (1, 15, 5),
       (2, 12, 20),
       (2, 15, 100),
       (3, 12, 10),
       (3, 15, 50),
       (4, 12, 1),
       (4, 15, 3),
       (5, 12, 50),
       (5, 15, 100);

INSERT INTO Operation_Items (OperationId, ItemId, Quantity, ItemType)
VALUES (12, 10, 1, 'Product'),
       (12, 11, 1, 'Product'),
       (15, 13, 2, 'Product'),
       (15, 14, 1, 'Product'),
       (14, 1, 100, 'Sources'),
       (13, 4, 1, 'Sources'),
       (13, 6, 1, 'Sources'),
       (13, 7, 1, 'Sources'),
       (10, 9, 50, 'Sources'),
       (11, 8, 100, 'Sources');

INSERT INTO Sub_Processes (ProcessId, SubProcessId)
VALUES (1, 5),
       (1, 6),
       (1, 7),
       (1, 9),
       (2, 3),
       (2, 4),
       (2, 8),
       (2, 10);